const BenefitContent: React.FC = () => {
    return (
        <div className="px-4">
            <h4 className="font-bold mb-2">เวย์โปรตีน โปรตีน สกัดจากนมวัวธรรมชาติ</h4>
            <p className="mb-4">แหล่งโปรตีนคุณภาพสูง ตัวเลือกที่ดีอันดับต้นๆ ด้วยความสะดวก และความบริสุทธิ์ของโปรตีนที่สูง ได้โปรตีนเน้นๆ
                โดยไม่ต้องรับพลังงาน ส่วนเกินจากไขมัน หรือแป้งที่จะมาพร้อมอาหารปกติ แถมยังสามารถย่อย และดูดซึมได้ไว
                ไม่เป็นภาระของกระเพาะอาหาร จึงเป็นอาหารเสริมตัวสำคัญสำหรับทุกเป้าหมาย ไม่ว่าจะสร้างกล้ามเนื้อ ลดไขมัน เพิ่มน้ำหนัก
                หรือ จะทานเพื่อสุขภาพ เสริมโปรตีนให้เพียงพอ เวย์โปรตีนก็ตอบได้ทุกโจทย์
            </p>
            <h2 className="font-bold my-2">ประโยชน์ของเวย์โปรตีน</h2>
            <ul className="list-disc pl-4">
                <li className="font-semibold">ซ่อมแซม และ สร้างกล้ามเนื้อ</li>
                <p className="mb-4">เวย์โปรตีน โปรตีนล้วนๆ ที่อุดมไปด้วย BCAA ที่เป็นกรดอะมิโนที่จำเป็น ที่เรียกว่าเป็นกุญแจสำคัญในการจุดชนวนการ
                    สร้างกล้ามเนื้อของร่างกาย และมีกรดอะมิโนอื่นๆ รวมกว่า 19 ชนิด ที่เป็นสารอาหารสำคัญสำหรับร่างกาย ช่วยทำให้ร่างกาย
                    ฟื้นฟูกล้ามเนื้อได้ไวขึ้น และสร้างมวลกล้ามเนื้อที่มากขึ้น
                </p>
                <p className="">(ปริมาณโปรตีนรวม (จากทุกๆแหล่ง) ที่ควรได้รับต่อวัน เพื่อการสร้างหล้ามเนื้อได้เต็มที่ แนะนำอยู่ที่ ประมาณ
                    1.5 - 2 กรัม / น้ำหนักตัว 1 กิโลกรัม ขึ้นไป)
                </p>
                <li className="font-semibold my-2">ร่างกายสามารถนำไปใช้ได้เต็มเม็ดเต็มหน่วย</li>
                <p className="mb-4">
                    เวย์โปรตีน เป็นโปรตีนกลุ่มที่ร่างกายสามารถนำไปใช้ได้ดีที่สุด ถ้าเราลองเทียบจากค่าง่ายๆ ที่เรารู้จักกันอย่างค่า BV
                    (Biological Value)[1] อกไก่มีคะแนนอยู่ที่ 79, ไข่ไก่ ได้คะแนน 100 ส่วน เวย์โปรตีน มีคะแนนอยู่ที่ 104 หรือ ค่าที่เจาะจงขึ้น
                    อย่างค่า DIAAS (Digestible Indispensable Amino Acid Scores)[2] อกไก่มีคะแนนอยู่ที่ 1 (1.08), ไข่ไก่ ได้ 1 (1.13)
                    และ เวย์โปรตีน ได้ 1 (1.07) คะแนน จะเห็นว่า เวย์โปรตีน นั้น อยู่ในกลุ่มโปรตีนที่มีคุณภาพสูงที่สุด ไม่ต่างจาก ไก่ และไข่เลย
                </p>
                <ul className="list-disc pl-4">
                    <li>ค่า Biological Value (BV) คือ ค่าพื้นฐานเพื่อบอกคุณภาพของโปรตีน โดยเทียบระหว่าง โปรตีนที่ได้รับ กับ ที่ร่างกายนำไปใช้ได้</li>
                    <li>ค่า Digestible Indispensable Amino Acid Scores (DIASS) คือ ค่าที่ใช้บอกคุณภาพของโปรตีนที่แม่นยำขึ้น และเป็นค่าหลักที่ใช้บอกคุณภาพโปรตีนในปัจจุบัน ที่คิดจากการดูซึมกรดอะมิโนต่างๆในลำไส้เล็ก เทียบ ปริมาณกรดอะมืโนืที่ดูดซึมได้ กับ กรดอะมิโนที่ร่างกายต้องการ</li>
                </ul>
                <li className="font-semibold my-2">ช่วยควบคุมน้ำหนักได้</li>
                <p className=" mb-4">
                    เวย์โปรตีนช่วยคุมความอยากอาหาร และของหวานได้ดี อย่างแรกเพราะรสชาติต่างๆที่ทำออกมา สามารถแทนของหวานได้
                    แต่ไม่ต้องรับ แป้ง หรือน้ำตาลส่วนเกิน เป็นแหล่งสารอาหาร และพลังงานที่มีคุณภาพกว่าของหวานมาก
                    <br></br>
                    สารอาหารประเภทโปรตีนยังทำให้ร่างกานรู้สึกอิ่มได้นานกว่าสารอาหารประเภทแป้ง ทำให้มีส่วนช่วยในการควนคุมน้ำหนักได้
                    และการทานโปรตีนที่สูง อาจส่งผลให้ร่างกายมีอัตราการเผาผลาญที่สูงขึ้น โดยเฉพาะเมื่อควบคู่กับการออกกำลังกาย
                </p>
                <li className="font-semibold my-2">เป็นอาหารเสริมที่ไม่มีอันตราย</li>
                <p className=" mb-4">
                    เวย์โปรตีนเป็นอาหารเสริมที่มีงานวิจัยรองรับมากเป็นอันดับต้นๆ และถูกใช้มากเป็นเวลาหลายสิบปี โดยที่ยังไม่พบอันตราย
                    หรือผลข้างเคียงของการทานเวย์โปรตีน สามารถใช้ได้ทุกเพศ ทุกวัย และสามารถทานเสริมกับอาหารหลักได้ โดยไม่จำกัดแค่
                    นักกีฬา หรือคนที่ออกกำลังกายเท่านั้น
                    <br></br>
                    เวย์โปรตีน จึงเป็นอาหารเสริมพื้นฐาน ที่ควรเลือกใช้ ไม่ว่าเป้าหมายของคุณจะเป็นอะไรก็ตาม
                </p></ul>
        </div>
    );
};

export default BenefitContent;
